In [2]:
#import pandas
import pandas as pd

In [3]:
df= pd.read_csv("E:\Data Science Practice\Salaries EDA\Salaries.csv")

C:\Users\Nour\AppData\Local\Temp\ipykernel_3864\2547294878.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df= pd.read_csv("E:\Data Science Practice\Salaries EDA\Salaries.csv")

In [4]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [6]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

#### what is the average TotalePay ?

In [7]:
df["TotalPay"].mean()

74768.32197169267

#### what is heighest amount of TotalPayBenefits ?

In [8]:
df["TotalPayBenefits"].max()

567595.43

#### What is the job title of JOSEPH DRISCOLL ?

In [9]:
joseph = df["EmployeeName"] == "JOSEPH DRISCOLL"
df["JobTitle"][joseph]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

#### how much JOSEPH DRISCOLL make (including benefis) ?

In [10]:
df["TotalPayBenefits"][joseph]

24    270324.91
Name: TotalPayBenefits, dtype: float64

#### what is the name of highest paid person (including benefis) ?

In [11]:
maxPaid= df["TotalPayBenefits"].max()
df[df["TotalPayBenefits"] == maxPaid]["EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

#### what is the name of lowest paid person (including benefis) ?

In [12]:
maxPaid= df["TotalPayBenefits"].min()
df[df["TotalPayBenefits"] == maxPaid]["EmployeeName"]

148653    Joe Lopez
Name: EmployeeName, dtype: object

#### What was the average (mean) basePay all employees per years ? (2011-2014)

In [25]:
df['BasePay'] = pd.to_numeric(df['BasePay'])

In [26]:
df.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

#### how many unique job titles are there ?

In [34]:
df["JobTitle"].nunique()

2159

#### what are top 5 common jobs ?

In [43]:
df["JobTitle"].value_counts()[:5]

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

#### How many job titles were represented by only one person in 2013 ?

In [52]:
(df[df["Year"] == 2013]["JobTitle"].value_counts()==1).sum()

202

#### How many people have the word Chief in their job title ?